# StairsTrisertypeFrontNosing Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsTrisertypeFrontNosing Property
ParameterTypeId Class See Also
---
"Front Nosing": (OBSOLETE)
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsTrisertypeFrontNosing { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsTrisertypeFrontNosing As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsTrisertypeFrontNosing {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace